{
    "id": 1,
    "name": "Text Anything",
    "description": "Text Anything is an SMS and WhatsApp marketing platform that helps businesses drive revenue through conversational messaging, 1-way alerts, QR-based lead capture, and more. The platform supports broadcast messaging, drip campaigns, opt-in collection, and multi-agent inboxes.",
    "status": "Active",
    "roleData": {
      "role": "service bot",
      "roleDescription": "Handles service-related queries."
    },
    "children": [
      {
        "id": 11,
        "name": "SMS Marketing",
        "description": "SMS marketing product with a built-in contact manager, drip campaigns, broadcast messaging, opt-in keyword-based capture, QR-code generation, and compliance tools like opt-out handling.",
        "status": "Active",
        "children": [
          {
            "id": 111,
            "name": "Starter Plan - SMS",
            "description": "Supports up to 10,000 contacts, 2,000 SMS/day, 3 QR campaigns, and standard automation features.",
            "status": "Active"
          },
          {
            "id": 112,
            "name": "Growth Plan - SMS",
            "description": "Supports 100,000 contacts, 25,000-50,000 SMS/day, 10 QR campaigns, advanced automation, and integrations.",
            "status": "Active"
          },
          {
            "id": 113,
            "name": "Premium Plan - SMS",
            "description": "Supports 750,000 contacts, 100,000+ SMS/day, 100 QR campaigns, with lowest per-message cost and white-glove support.",
            "status": "Active"
          }
        ]
      },
      {
        "id": 12,
        "name": "WhatsApp Marketing",
        "description": "Meta-verified WhatsApp marketing platform offering bulk and automated messaging, green tick verification, quick replies, conversational templates, and support for media-rich campaigns.",
        "status": "Active",
        "children": [
          {
            "id": 121,
            "name": "Free Trial - WhatsApp",
            "description": "2-week trial with 1,000 contact limit, access to full WhatsApp features, no credit card needed, includes API onboarding.",
            "status": "Draft"
          },
          {
            "id": 122,
            "name": "Paid Plan - WhatsApp",
            "description": "Supports 10,000 to 750,000 contacts, Meta tier-based daily messaging limits, includes opt-in flows, API access, auto-replies, and broadcast management.",
            "status": "Active"
          }
        ]
      },
      {
        "id": 13,
        "name": "Salesforce Products",
        "description": "Native Salesforce apps to send SMS and WhatsApp messages directly from within the Salesforce CRM, with automation and workflow integration.",
        "status": "Active",
        "children": [
          {
            "id": 131,
            "name": "Text Anything for Salesforce",
            "description": "All-in-one app to send SMS and WhatsApp messages from Salesforce using pre-built automation, native components, and standard pricing.",
            "status": "Active"
          },
          {
            "id": 132,
            "name": "Text Anything for Salesforce + Twilio",
            "description": "Version of the Salesforce app allowing businesses to use their own Twilio number, infrastructure, and billing while accessing all messaging features.",
            "status": "Active"
          }
        ]
      }
    ]
  }
  